-- Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка),
-- у которых средняя оценка не больше минимальной оценк(е|и) в группе 1101.

SELECT 
    Н_ЛЮДИ.ИД AS НОМЕР, 
    CONCAT(Н_ЛЮДИ.ФАМИЛИЯ, ' ', Н_ЛЮДИ.ИМЯ, ' ', Н_ЛЮДИ.ОТЧЕСТВО) AS ФИО, 
    AVG(CASE WHEN Н_ВЕДОМОСТИ.ОЦЕНКА ~ '^[0-9]+$' THEN Н_ВЕДОМОСТИ.ОЦЕНКА::NUMERIC ELSE NULL END) AS СР_ОЦЕНКА 
    FROM Н_ЛЮДИ
        INNER JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД AND (Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ < Н_ЛЮДИ.ДАТА_СМЕРТИ 
            OR (Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ IS NOT NULL AND Н_ЛЮДИ.ДАТА_СМЕРТИ IS NULL)) 
        INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
        INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
        WHERE Н_УЧЕНИКИ.ГРУППА = '4100' AND Н_ВЕДОМОСТИ.ОЦЕНКА ~ '^[0-9]+$'
        GROUP BY Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО
    HAVING AVG(CASE WHEN Н_ВЕДОМОСТИ.ОЦЕНКА ~ '^[0-9]+$' THEN Н_ВЕДОМОСТИ.ОЦЕНКА::NUMERIC ELSE NULL END) <= (
        SELECT MIN(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS NUMERIC)) AS МИНИМАЛЬНАЯ_ОЦЕНКА FROM Н_ЛЮДИ 
            INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
            INNER JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
            INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
            WHERE Н_УЧЕНИКИ.ГРУППА = '1101' AND Н_ВЕДОМОСТИ.ОЦЕНКА ~ '^[0-9]+$');