-- Сформировать запрос для получения числа на ФКТИУ троечников.

SELECT COUNT(Н_ЛЮДИ.ИД) FROM Н_ЛЮДИ 
    INNER JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД AND Н_ВЕДОМОСТИ.ОЦЕНКА = '3'
        AND (Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ < Н_ЛЮДИ.ДАТА_СМЕРТИ 
            OR (Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ IS NOT NULL AND Н_ЛЮДИ.ДАТА_СМЕРТИ IS NULL)) 
    INNER JOIN Н_ОБУЧЕНИЯ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД 
    INNER JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    INNER JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    INNER JOIN Н_ОТДЕЛЫ ON Н_ОТДЕЛЫ.ИД = Н_ПЛАНЫ.ОТД_ИД AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';